FahrJo/STM32F4_Transportkontrollsystem/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_I2C3_Init();
  MX_FATFS_Init();
  MX_SDIO_SD_Init();
  MX_SPI1_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */
	
	/* Vorbereiten der SD-Karte ------------------------------------------------*/
	if(f_mount(&myFatFS, SDPath, 1) == FR_OK){
		if(f_open(&configFile, configFileName, FA_READ | FA_OPEN_EXISTING) == FR_OK){
			f_read(&configFile, configBuffer, sizeof(configBuffer), &configCursor);
			if (ini_parse_string(configBuffer, Preferences_Handler, &config) < 0) {
        for(int i=0;i<3;i++){										/* wenn Lesefehler dann blinken alle 3 mal */
					HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
					HAL_Delay(200);
					HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
					HAL_Delay(200);
				}
			}
		}
		write_string_to_file(&logFile, logFileName, header,	sizeof(header), &cursor);
	}
	else{
		HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
	}

	Timer4_Init();
	AnalogWDG_Init();
	
	
	/* Acc-Sensor ueber I2C deaktivieren und dann wieder aktivieren, damit dieser sicher aktiviert wird */
	if(config.ACCELERATION_ENABLE){
		HAL_Delay(500);
		ACC_deactivate(&hi2c3);
		HAL_Delay(500);
		ACC_activate(&hi2c3);
		HAL_Delay(500);
	}
	
	if(config.GNSS_ENABLE) {
		config.GNSS_ENABLE = 0; 										/* erst mal deaktiveren, wenn GPS aktivierung erfolgreich wird es wieder ENABLED */
		HAL_GPIO_WritePin(GPS_Reset_out_GPIO_Port, GPS_Reset_out_Pin, GPIO_PIN_SET);
		for(int i = 0; i < 4; i++){									/* wenn nach 4 Versuchen, das Modul nicht aktivert werden kann, bleibt GNSS_ENABLE=0 und das Programm lauft "normal" weiter */
				if(-1 != GPS_activateReceiver()){ 			/* GPS erfolgreich aktiviert, for-Schleife verlassen */
				config.GNSS_ENABLE=1;
				i = 5;

				/* Starte GPS UART DMA -----------------------------------------------------*/
				HAL_UART_Receive_DMA(&huart3, (uint8_t*)&gpsRxRingBuffer, GPS_RINGBUFFER_SIZE);
				__HAL_UART_ENABLE_IT(&huart3, UART_IT_TC );
				__HAL_UART_ENABLE_IT(&huart3, UART_IT_IDLE );
			}
			HAL_Delay(100);
		}
	}

	/* Starte ADC --------------------------------------------------------------*/
	if(config.TEMP_ENABLE){
		HAL_ADC_Start_DMA(&hadc1, &Temp_Raw, 1);
		HAL_ADC_Start_IT(&hadc1);
	}
	
	GET_DATA = config.ACCELERATION_ENABLE + config.GNSS_ENABLE + config.LIGHT_ENABLE + config.TEMP_ENABLE;		/* initialisiere Counter zum sammeln eines Datensatzes */
			
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		
		if(getLight | getTemp | getAcceleration | getPosition | getDataset){
		
			/* Einlesen der Fotodiode und Ablage in den Datensatz ------------------*/
			if(config.LIGHT_ENABLE){
				if(getLight | getDataset){
					getLight = 0;
					getDataset--;
					
					if(HAL_GPIO_ReadPin(INT_Photodiode_GPIO_Port, INT_Photodiode_Pin) == 1){
						sensor_set[actualSet].open = 1;
					}
					else{
						sensor_set[actualSet].open = 0;
					}
				}
			}
			
			/* Einlesen der Temperatur und Ablage in den Datensatz -----------------*/
			if(config.TEMP_ENABLE){
				HAL_ADC_Start_IT(&hadc1);
				
				if(getTemp | getDataset){
					getTemp = 0;
					getDataset--;
					
					sensor_set[actualSet].temperature = 300 * 2 * Temp_Raw / 4096 - 273;    /* Umrechnung der 12-Bit Rohdaten in �C */
					Temp = sensor_set[actualSet].temperature;
				}
			}
			
			/* Einlesen der Beschleunigungsdaten und Ablage in den Datensatz -------*/
			if(config.ACCELERATION_ENABLE){
				
				if(getAcceleration | getDataset){
					getAcceleration = 0;
					getDataset--;
					
					i2c_status = ACC_getAllValues(&hi2c3, &acceleration_actual);
					if(i2c_status == HAL_OK){
//						acceleration_actual_float.x_Value = ACC_convertAccelToFloat(acceleration_actual.x_Value, 12, 2);
//						acceleration_actual_float.y_Value = ACC_convertAccelToFloat(acceleration_actual.y_Value, 12, 2);
//						acceleration_actual_float.z_Value = ACC_convertAccelToFloat(acceleration_actual.z_Value, 12, 2);
						sensor_set[actualSet].acceleration = acceleration_actual;
					}
					else{																	/* wenn Lesefehler dann blinken alle 3 mal */
						for(int i=0;i<3;i++){
							HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
							HAL_Delay(200);
							HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
							HAL_Delay(200);
						}
					}
				}
			}
			
			/* Einlesen der Positionsdaten und Ablage in den Datensatz -------------*/
			if(config.GNSS_ENABLE){
				if(getPosition | getDataset){
					getPosition = 0;
					getDataset--;
					if(g_newGPSData){											/* check for new UART GPS Data, and read in before using GPS dataset */
						GPS_sortInNewData(&gpsActualDataset, gpsRxRingBuffer);		/* read in new data */
						g_newGPSData = 0; 									/* reset flag	*/
					}
					/* aus aktuellem GPS Set */
				//	strcpy(sensor_set[actualSet].NMEA_GPGGA, gpsActualDataset.NMEA_GPGGA);
			  //	strcpy(sensor_set[actualSet].NMEA_GPRMC, gpsActualDataset.NMEA_GPRMC); // so wenn sensorSet zweimal char[80] enthält
					sensor_set[actualSet].NMEA_GPRMC = gpsActualDataset.NMEA_GPRMC;
					sensor_set[actualSet].NMEA_GPGGA = gpsActualDataset.NMEA_GPGGA;
					sensor_set[actualSet].timestamp = clock_time;		/* von Timer incrementiert, kann aber auch noch von GPS ab und so korrigiert werden */
				}
			}
			
			actualSet++;
		}
		
		
		/* Fuellen des Datensatzes und Abspeichern auf die SD-Karte ---------------*/
		if((actualSet == datasetCount) | writeDataset | (event == eject_card)) {
			HAL_NVIC_DisableIRQ(TIM4_IRQn);
			write_dataset_to_file(&logFile, logFileName, sensor_set, actualSet, &cursor);
			writeDataset = 0;
			actualSet = 0;
			if(event == eject_card){
				HAL_GPIO_WritePin(LED4_GPIO_Port, LED4_Pin, GPIO_PIN_SET);
				event = deactivate_gnss;               	/* Deaktiviere GNSS-Modul vor dem Abschalten */
			}
			else{
				HAL_NVIC_EnableIRQ(TIM4_IRQn);
			}
		}
		
		/* Deaktivieren des GNSS-Moduls -------------------------------------------*/
		if(event == deactivate_gnss) {
			if(GPS_deactivateReceiver() != -1) {
				HAL_GPIO_WritePin(LED6_GPIO_Port, LED6_Pin, GPIO_PIN_SET);
				event = no_event;
			}
		}
  }
  /* USER CODE END 3 */

